<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on Dezembro, 9 2014 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual do Maxima 5.35.0: 44. descriptive</title>

<meta name="description" content="Manual do Maxima 5.35.0: 44. descriptive">
<meta name="keywords" content="Manual do Maxima 5.35.0: 44. descriptive">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}

-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="pt" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="descriptive"></a>
<a name="SEC173"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_43.html#SEC172" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC174" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_43.html#SEC171" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC179" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC271" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 44. descriptive </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC174">44.1 Introdução ao pacote descriptive</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC175">44.2 Definições para manipulação da dados</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC176">44.3 Definições para estatística descritiva</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC177">44.4 Definições específicas para estatística descritiva de várias variáveis</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC178">44.5 Definições para gráficos estatísticos</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Introdu_00e7_00e3o-ao-pacote-descriptive"></a>
<a name="SEC174"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC173" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC175" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC173" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC173" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC179" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC271" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 44.1 Introdução ao pacote descriptive </h2>

<p>O pacote <code>descriptive</code> contém um conjunto de funções para fazer cálculos de estatística descritiva e desenhar gráficos. Juntamente com o código fonte três conjuntos de dados em suar árvore do Maxima: <code>pidigits.data</code>, <code>wind.data</code> e <code>biomed.data</code>. Eles também podem ser baixados a partir de <code>www.biomates.net</code>.
</p>
<p>Qualque manual de estatística pode ser usado como referência para as funções no pacote <code>descriptive</code>.
</p>
<p>Para comentários, erros ou sugestões, por favor entre em contato comigo em <var>'mario AT edu DOT xunta DOT es'</var>.
</p>
<p>Aqui está um exemplo sobre como as funções de estatística descritiva no pacote <code>descriptive</code> fazem esse trabalho, dependendo da natureza de seus argumentos, listas e matrizes,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) /* univariate sample */   mean ([a, b, c]);
                            c + b + a
(%o2)                       ---------
                                3
(%i3) matrix ([a, b], [c, d], [e, f]);
                            [ a  b ]
                            [      ]
(%o3)                       [ c  d ]
                            [      ]
                            [ e  f ]
(%i4) /* amostra de várias variáveis */ mean (%);
                      e + c + a  f + d + b
(%o4)                [---------, ---------]
                          3          3
</pre>
<p>Note que em amostras de várias variáveis a média é calculada em cada coluna.
</p>
<p>No caso de muitas amostras amostras com possíveis tamanhos diferentes, A função do Maxima <code>map</code> pode ser usada para pegar os resultados desejados de cada amostra,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) map (mean, [[a, b, c], [d, e]]);
                        c + b + a  e + d
(%o2)                  [---------, -----]
                            3        2
</pre>
<p>Nesse caso, duas amostras de tamanhos 3 e 2 foram armazenadas em uma lista.
</p>
<p>Amostras de uma única variável devem ser armazenadas em listas como
</p>
<pre class="example">(%i1) s1 : [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5];
(%o1)           [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5]
</pre>
<p>e amostras de várias variáveis em matrizes como em
</p>
<pre class="example">(%i1) s2 : matrix ([13.17, 9.29], [14.71, 16.88], [18.50, 16.88],
             [10.58, 6.63], [13.33, 13.25], [13.21,  8.12]);
                        [ 13.17  9.29  ]
                        [              ]
                        [ 14.71  16.88 ]
                        [              ]
                        [ 18.5   16.88 ]
(%o1)                   [              ]
                        [ 10.58  6.63  ]
                        [              ]
                        [ 13.33  13.25 ]
                        [              ]
                        [ 13.21  8.12  ]
</pre>
<p>Nesse caso, o número de colunas é igual à dimensão (ao número) de variáveis e o n;umero de linhas é o tamano da amostra.
</p>
<p>Dados podem ser introduzidos manualmente, mas grandes amostras são usualmente armazenadas em ficheiros no formato texto plano. Por exemplo, o ficheiro <code>pidigits.data</code> contém os primeiros 100 dígitos do número <code>%pi</code>:
</p><pre class="example">      3
      1
      4
      1
      5
      9
      2
      6
      5
      3 ...
</pre>
<p>Com o objectivo de chamar esses dígitos no Maxima,
</p>
<pre class="example">(%i1) load (numericalio)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) length (s1);
(%o3)                          100
</pre>
<p>Por outro lado, o ficheiro <code>wind.data</code> contém a média diária de velocidades do ventoem 5 estações meteorológicas na República da Irlanda (Esses dados são parte de um conjunto de dados tomados em 12 estações meteorológicas. O ficheiro original está disponivel livremente para download no Repositório de Dados StatLib e sua análise é discutida em Haslett, J., Raftery, A. E. (1989) <var>Space-time Modelling with Long-memory Dependence: Assessing Ireland's Wind Power Resource, with Discussion</var>. Applied Statistics 38, 1-50). As linhas seguintes mostram como tornar os dados disponíveis para o Maxima:
</p>
<pre class="example">(%i1) load (numericalio)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) length (s2);
(%o3)                          100
(%i4) s2 [%]; /* last record */
(%o4)            [3.58, 6.0, 4.58, 7.62, 11.25]
</pre>
<p>Algumas amostras possuem dados não numéricos. Como um exemplo, o ficheiro <code>biomed.data</code> (que é parte de outro grande ficheiro tomado do Repósitório de Dados StatLib) contém quatro medidas sanguíneas tomadas de dois grupos de pacientes, <code>A</code> e <code>B</code>, de diferentes idades,
</p>
<pre class="example">(%i1) load (numericalio)$
(%i2) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i3) length (s3);
(%o3)                          100
(%i4) s3 [1]; /* first record */
(%o4)            [A, 30, 167.0, 89.0, 25.6, 364]
</pre>
<p>O primeiro indivíduo pertence ao grupo <code>A</code>, com 30 anos de idade e suas medidas sanguíneas foram 167.0, 89.0, 25.6 e 364.
</p>
<p>Se deve tomar cuidado quando se trabalha com dados divididos por categorias. no exemplo seguinte, ao símbolo <code>a</code> é atribuído um valor em algum momento anterior e então a amostra com valores divididos por categoria <code>a</code> é interpretada como,
</p>
<pre class="example">(%i1) a : 1$
(%i2) matrix ([a, 3], [b, 5]);
                            [ 1  3 ]
(%o2)                       [      ]
                            [ b  5 ]
</pre>


<hr size="6">
<a name="Defini_00e7_00f5es-para-manipula_00e7_00e3o-da-dados"></a>
<a name="SEC175"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC174" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC176" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC173" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC173" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC179" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC271" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 44.2 Definições para manipulação da dados </h2>

<dl>
<dt><u>Função:</u> <b>continuous_freq</b><i> (<var>list</var>)</i>
<a name="IDX1395"></a>
</dt>
<dt><u>Função:</u> <b>continuous_freq</b><i> (<var>list</var>, <var>m</var>)</i>
<a name="IDX1396"></a>
</dt>
<dd><p>O argumento de <code>continuous_freq</code> deve ser uma lista de números, que serão então agrupadas em intervalos e contado quantos desses dados pertencem a cada grupo. Opcionalmente, a função <code>continuous_freq</code> admite um segundo argumento indicando o número de classes, 10 é o valor padrão,
</p>
<pre class="example">(%i1) load (numericalio)$
(%i2) load (descriptive)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) continuous_freq (s1, 5);
(%o4) [[0, 1.8, 3.6, 5.4, 7.2, 9.0], [16, 24, 18, 17, 25]]
</pre>
<p>A primeira lista contém os limites de intervalos e o segundo a correspondente contagem: existem 16 algarismos da parte decimal de <code>%pi</code> dentro do intervalo <code>[0, 1.8]</code>, isto é 0's e 1's, 24 algarismos em <code>(1.8, 3.6]</code>, isto é 2's e 3's, e assim por diante.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>discrete_freq</b><i> (<var>list</var>)</i>
<a name="IDX1397"></a>
</dt>
<dd><p>Conta as frequências absolutas em amostras discretas, em amostras numéricas e em amostras divididas em categorias. Seu único argumento é uma lista,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;));
(%o3) [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5, 8, 9, 7, 9, 3, 2, 3, 8, 
4, 6, 2, 6, 4, 3, 3, 8, 3, 2, 7, 9, 5, 0, 2, 8, 8, 4, 1, 9, 7, 
1, 6, 9, 3, 9, 9, 3, 7, 5, 1, 0, 5, 8, 2, 0, 9, 7, 4, 9, 4, 4, 
5, 9, 2, 3, 0, 7, 8, 1, 6, 4, 0, 6, 2, 8, 6, 2, 0, 8, 9, 9, 8, 
6, 2, 8, 0, 3, 4, 8, 2, 5, 3, 4, 2, 1, 1, 7, 0, 6, 7]
(%i4) discrete_freq (s1);
(%o4) [[0, 1, 2, 3, 4, 5, 6, 7, 8, 9], 
                             [8, 8, 12, 12, 10, 8, 9, 8, 12, 13]]
</pre>
<p>A primeira lista fornece os valores da amostra e a segunda as suas
frequências absolutas. Os comandos <code>? col</code> e <code>? transpose</code>
podem ajudá-lo a entender o último comando de entrada.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>subsample</b><i> (<var>matriz_de_dados</var>, <var>expressão_lógica</var>)</i>
<a name="IDX1398"></a>
</dt>
<dt><u>Função:</u> <b>subsample</b><i> (<var>matriz_de_dados</var>, <var>expressão_lógica</var>, <var>col_num</var>, <var>col_num</var>, ...)</i>
<a name="IDX1399"></a>
</dt>
<dd><p>Essas funções são um tipo de variação da função <code>submatrix</code> do Maxima. O primeiro argumento é o nome da matriz de dados, o segundo argumento é uma expressão lógica que recebeu apóstrofo e os argumentos opcionais adicionais são o número de colunas a serem tomadas. Esse comportamento é melhor entendido com exemplos,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) subsample (s2, '(%c[1] &gt; 18));
              [ 19.38  15.37  15.12  23.09  25.25 ]
              [                                   ]
              [ 18.29  18.66  19.08  26.08  27.63 ]
(%o4)         [                                   ]
              [ 20.25  21.46  19.95  27.71  23.38 ]
              [                                   ]
              [ 18.79  18.96  14.46  26.38  21.84 ]
</pre>
<p>Existem registros de várias variáveis nos quais a velocidade do vento na primeira estação meteorológica foram maiores que 18. Veja que na expressão lógica que recebeu apóstrofo o <var>i</var>-ésimo componente é referenciado como <code>%c[i]</code>. O símbolo <code>%c[i]</code> é usado dentro da função <code>subsample</code>, portanto quando usado como uma variável de uma categoria, Maxima fica confuso. No seguinte exemplo, requisitamos somente o primeiro, o segundo e o quinto componentes desses registro com velocidades de vento maiores que ou igual a 16 nós na estação meteorológica número 1 e menor que 25 nós na estação meteorológica número 4,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) subsample (s2, '(%c[1] &gt;= 16 and %c[4] &lt; 25), 1, 2, 5);
                     [ 19.38  15.37  25.25 ]
                     [                     ]
                     [ 17.33  14.67  19.58 ]
(%o4)                [                     ]
                     [ 16.92  13.21  21.21 ]
                     [                     ]
                     [ 17.25  18.46  23.87 ]
</pre>
<p>Aqui está um exemplo com as variáveis divididas em categorias do ficheiro <code>biomed.data</code>. Queremos os registros correspondentes a aqueles pacientes no grupo <code>B</code> que possuem idade maior que 38 anos,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i4) subsample (s3, '(%c[1] = B and %c[2] &gt; 38));
                [ B  39  28.0  102.3  17.1  146 ]
                [                               ]
                [ B  39  21.0  92.4   10.3  197 ]
                [                               ]
                [ B  39  23.0  111.5  10.0  133 ]
                [                               ]
                [ B  39  26.0  92.6   12.3  196 ]
(%o4)           [                               ]
                [ B  39  25.0  98.7   10.0  174 ]
                [                               ]
                [ B  39  21.0  93.2   5.9   181 ]
                [                               ]
                [ B  39  18.0  95.0   11.3  66  ]
                [                               ]
                [ B  39  39.0  88.5   7.6   168 ]
</pre>

<p>Probavelmente, a análise estatística irá envolver somente as medidas sanguíneas,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i4) subsample (s3, '(%c[1] = B and %c[2] &gt; 38), 3, 4, 5, 6);
                   [ 28.0  102.3  17.1  146 ]
                   [                        ]
                   [ 21.0  92.4   10.3  197 ]
                   [                        ]
                   [ 23.0  111.5  10.0  133 ]
                   [                        ]
                   [ 26.0  92.6   12.3  196 ]
(%o4)              [                        ]
                   [ 25.0  98.7   10.0  174 ]
                   [                        ]
                   [ 21.0  93.2   5.9   181 ]
                   [                        ]
                   [ 18.0  95.0   11.3  66  ]
                   [                        ]
                   [ 39.0  88.5   7.6   168 ]
</pre>

<p>Essa é a média de várias variáveis de <code>s3</code>,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i4) mean (s3);
       65 B + 35 A  317          6 NA + 8145.0
(%o4) [-----------, ---, 87.178, -------------, 18.123, 
           100      10                100
                                                    3 NA + 19587
                                                    ------------]
                                                        100
</pre><p>Aqui, a primeira componente é sem sentido, uma vez que <code>A</code> e <code>B</code> são categorias, o segundo componente é a idade média dos indivíduos na forma racional, e o quarto eo último valores exibem um comportamento estranho. Isso ocorre porque o símbolo <code>NA</code> é usado aqui para indicar dado não disponível (<var>non available</var> em inglês), e as duas médias são certamente sem sentido. Uma solução possível pode ser jogar fora a matriz cujas linhas possuam símbolos <code>NA</code>, embora isso cause alguma perda de informação,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i4) mean (subsample (s3, '(%c[4] # NA and %c[6] # NA), 3, 4, 5, 6));
(%o4) [79.4923076923077, 86.2032967032967, 16.93186813186813, 
                                                            2514
                                                            ----]
                                                             13
</pre></dd></dl>


<hr size="6">
<a name="Defini_00e7_00f5es-para-estat_00edstica-descritiva"></a>
<a name="SEC176"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC175" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC177" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC173" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC173" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC179" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC271" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 44.3 Definições para estatística descritiva </h2>



<dl>
<dt><u>Função:</u> <b>mean</b><i> (<var>lista</var>)</i>
<a name="IDX1400"></a>
</dt>
<dt><u>Função:</u> <b>mean</b><i> (<var>matriz</var>)</i>
<a name="IDX1401"></a>
</dt>
<dd><p>Essa função calcula a média de uma amostra, definida como
</p><pre class="example">                       n
                     ====
             _   1   \
             x = -    &gt;    x
                 n   /      i
                     ====
                     i = 1
</pre>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) mean (s1);
                               471
(%o4)                          ---
                               100
(%i5) %, numer;
(%o5)                         4.71
(%i6) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i7) mean (s2);
(%o7)     [9.9485, 10.1607, 10.8685, 15.7166, 14.8441]
</pre></dd></dl>



<dl>
<dt><u>Função:</u> <b>var</b><i> (<var>list</var>)</i>
<a name="IDX1402"></a>
</dt>
<dt><u>Função:</u> <b>var</b><i> (<var>matrix</var>)</i>
<a name="IDX1403"></a>
</dt>
<dd><p>This is the sample variance, defined as
</p><pre class="example">                     n
                   ====
           2   1   \          _ 2
          s  = -    &gt;    (x - x)
               n   /       i
                   ====
                   i = 1
</pre>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) var (s1), numer;
(%o4)                   8.425899999999999
</pre>
<p>See also function <code>var1</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>var1</b><i> (<var>lista</var>)</i>
<a name="IDX1404"></a>
</dt>
<dt><u>Função:</u> <b>var1</b><i> (<var>matriz</var>)</i>
<a name="IDX1405"></a>
</dt>
<dd><p>Essa função calcula a variância da amostra, definida como
</p><pre class="example">                     n
                   ====
               1   \          _ 2
              ---   &gt;    (x - x)
              n-1  /       i
                   ====
                   i = 1
</pre>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) var1 (s1), numer;
(%o4)                    8.5110101010101
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) var1 (s2);
(%o6) [17.39586540404041, 15.13912778787879, 15.63204924242424, 
                            32.50152569696971, 24.66977392929294]
</pre>
<p>See also function <code>var</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>std</b><i> (<var>lista</var>)</i>
<a name="IDX1406"></a>
</dt>
<dt><u>Função:</u> <b>std</b><i> (<var>matriz</var>)</i>
<a name="IDX1407"></a>
</dt>
<dd><p>A raíz quadrada da função <code>var</code>, a variância com denominador <em>n</em>.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) std (s1), numer;
(%o4)                   2.902740084816414
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) std (s2);
(%o6) [4.149928523480858, 3.871399812729241, 3.933920277534866, 
                            5.672434260526957, 4.941970881136392]
</pre>
<p>Veja também as funções <code>var</code> e <code>std1</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>std1</b><i> (<var>lista</var>)</i>
<a name="IDX1408"></a>
</dt>
<dt><u>Função:</u> <b>std1</b><i> (<var>matriz</var>)</i>
<a name="IDX1409"></a>
</dt>
<dd><p>É a raíz quadrada da função <code>var1</code>, a variância com denominador <em>n-1</em>.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) std1 (s1), numer;
(%o4)                   2.917363553109228
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) std1 (s2);
(%o6) [4.17083509672109, 3.89090320978032, 3.953738641137555, 
                            5.701010936401517, 4.966867617451963]
</pre>
<p>Veja também as funções <code>var1</code> e <code>std</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>noncentral_moment</b><i> (<var>lista</var>, <var>k</var>)</i>
<a name="IDX1410"></a>
</dt>
<dt><u>Função:</u> <b>noncentral_moment</b><i> (<var>matriz</var>, <var>k</var>)</i>
<a name="IDX1411"></a>
</dt>
<dd><p>O momento não central de ordem <em>k</em>, definido como
</p><pre class="example">                       n
                     ====
                 1   \      k
                 -    &gt;    x
                 n   /      i
                     ====
                     i = 1
</pre>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) noncentral_moment (s1, 1), numer; /* the mean */
(%o4)                         4.71
(%i6) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i7) noncentral_moment (s2, 5);
(%o7) [319793.8724761506, 320532.1923892463, 391249.5621381556, 
                            2502278.205988911, 1691881.797742255]
</pre>
<p>Veja também a função <code>central_moment</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>central_moment</b><i> (<var>lista</var>, <var>k</var>)</i>
<a name="IDX1412"></a>
</dt>
<dt><u>Função:</u> <b>central_moment</b><i> (<var>matriz</var>, <var>k</var>)</i>
<a name="IDX1413"></a>
</dt>
<dd><p>O momento central de ordem <em>k</em>, definido como
</p><pre class="example">                    n
                  ====
              1   \          _ k
              -    &gt;    (x - x)
              n   /       i
                  ====
                  i = 1
</pre>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) central_moment (s1, 2), numer; /* a variância */
(%o4)                   8.425899999999999
(%i6) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i7) central_moment (s2, 3);
(%o7) [11.29584771375004, 16.97988248298583, 5.626661952750102, 
                             37.5986572057918, 25.85981904394192]
</pre>
<p>Veja também as funções <code>central_moment</code> e <code>mean</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>cv</b><i> (<var>lista</var>)</i>
<a name="IDX1414"></a>
</dt>
<dt><u>Função:</u> <b>cv</b><i> (<var>matriz</var>)</i>
<a name="IDX1415"></a>
</dt>
<dd><p>O coeficiente de variação é o quociente entre o desvio padrão da amostra (<code>std</code>) e a média <code>mean</code>,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) cv (s1), numer;
(%o4)                   .6193977819764815
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) cv (s2);
(%o6) [.4192426091090204, .3829365309260502, 0.363779605385983, 
                            .3627381836021478, .3346021393989506]
</pre>
<p>Veja também as funções <code>std</code> e <code>mean</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>mini</b><i> (<var>lista</var>)</i>
<a name="IDX1416"></a>
</dt>
<dt><u>Função:</u> <b>mini</b><i> (<var>matriz</var>)</i>
<a name="IDX1417"></a>
</dt>
<dd><p>É o valor mínimo da amostra <var>lista</var>,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) mini (s1);
(%o4)                           0
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) mini (s2);
(%o6)             [0.58, 0.5, 2.67, 5.25, 5.17]
</pre>
<p>Veja também função <code>maxi</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>maxi</b><i> (<var>lista</var>)</i>
<a name="IDX1418"></a>
</dt>
<dt><u>Função:</u> <b>maxi</b><i> (<var>matriz</var>)</i>
<a name="IDX1419"></a>
</dt>
<dd><p>É o valor máximo da amostra <var>lista</var>,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) maxi (s1);
(%o4)                           9
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) maxi (s2);
(%o6)          [20.25, 21.46, 20.04, 29.63, 27.63]
</pre>
<p>Veja também a função <code>mini</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>range</b><i> (<var>lista</var>)</i>
<a name="IDX1420"></a>
</dt>
<dt><u>Função:</u> <b>range</b><i> (<var>matriz</var>)</i>
<a name="IDX1421"></a>
</dt>
<dd><p>A amplitude é a diferença entre os valores de maximo e de mínimo.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) range (s1);
(%o4)                           9
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) range (s2);
(%o6)          [19.67, 20.96, 17.37, 24.38, 22.46]
</pre></dd></dl>



<dl>
<dt><u>Função:</u> <b>quantile</b><i> (<var>lista</var>, <var>p</var>)</i>
<a name="IDX1422"></a>
</dt>
<dt><u>Função:</u> <b>quantile</b><i> (<var>matriz</var>, <var>p</var>)</i>
<a name="IDX1423"></a>
</dt>
<dd><p>É o <var>p</var>-<code>quantile</code> (quantil de ordem <var>p</var>), com <var>p</var> sendo um número em <em>[0, 1]</em> (intervalo fechado), da amostra <var>lista</var>.
Embora exista muitas Definições para quantil de uma amostra (Hyndman, R. J., Fan, Y. (1996) <var>Sample quantiles in statistical packages</var>. American Statistician, 50, 361-365), aquela que se baseia em interpolação linear é a que foi implementada no pacote <code>descriptive</code>.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) /* 1st and 3rd quartiles */ [quantile (s1, 1/4), quantile (s1, 3/4)], numer;
(%o4)                      [2.0, 7.25]
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) quantile (s2, 1/4);
(%o6)    [7.2575, 7.477500000000001, 7.82, 11.28, 11.48]
</pre></dd></dl>



<dl>
<dt><u>Função:</u> <b>median</b><i> (<var>lista</var>)</i>
<a name="IDX1424"></a>
</dt>
<dt><u>Função:</u> <b>median</b><i> (<var>matriz</var>)</i>
<a name="IDX1425"></a>
</dt>
<dd><p>Uma vez que a amostra está ordenada, se o tamanho da amostra for ímpar a mediana é o valor central, de outra forma a mediana será a média dos dois valores centrais.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) median (s1);
                                9
(%o4)                           -
                                2
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) median (s2);
(%o6)         [10.06, 9.855, 10.73, 15.48, 14.105]
</pre>
<p>A mediana é o 1/2-<code>quantil</code>.
</p>
<p>Veja também function <code>quantile</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>qrange</b><i> (<var>lista</var>)</i>
<a name="IDX1426"></a>
</dt>
<dt><u>Função:</u> <b>qrange</b><i> (<var>matriz</var>)</i>
<a name="IDX1427"></a>
</dt>
<dd><p>A amplitude do interquartil é a diferença entre o terceiro e o primeiro quartil, <code>quantile(<var>lista</var>,3/4) - quantile(<var>lista</var>,1/4)</code>,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) qrange (s1);
                               21
(%o4)                          --
                               4
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) qrange (s2);
(%o6) [5.385, 5.572499999999998, 6.0225, 8.729999999999999, 
                                               6.650000000000002]
</pre>
<p>Veja também a função <code>quantile</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>mean_deviation</b><i> (<var>lista</var>)</i>
<a name="IDX1428"></a>
</dt>
<dt><u>Função:</u> <b>mean_deviation</b><i> (<var>matriz</var>)</i>
<a name="IDX1429"></a>
</dt>
<dd><p>O desvio médio, definido como
</p><pre class="example">                     n
                   ====
               1   \          _
               -    &gt;    |x - x|
               n   /       i
                   ====
                   i = 1
</pre>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) mean_deviation (s1);
                               51
(%o4)                          --
                               20
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) mean_deviation (s2);
(%o6) [3.287959999999999, 3.075342, 3.23907, 4.715664000000001, 
                                               4.028546000000002]
</pre>
<p>Veja também a função <code>mean</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>median_deviation</b><i> (<var>lista</var>)</i>
<a name="IDX1430"></a>
</dt>
<dt><u>Função:</u> <b>median_deviation</b><i> (<var>matriz</var>)</i>
<a name="IDX1431"></a>
</dt>
<dd><p>O desvio da mediana, definido como
</p><pre class="example">                 n
               ====
           1   \
           -    &gt;    |x - med|
           n   /       i
               ====
               i = 1
</pre><p>onde <code>med</code> é a mediana da <var>lista</var>.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) median_deviation (s1);
                                5
(%o4)                           -
                                2
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) median_deviation (s2);
(%o6)           [2.75, 2.755, 3.08, 4.315, 3.31]
</pre>
<p>Veja também a função <code>mean</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>harmonic_mean</b><i> (<var>lista</var>)</i>
<a name="IDX1432"></a>
</dt>
<dt><u>Função:</u> <b>harmonic_mean</b><i> (<var>matriz</var>)</i>
<a name="IDX1433"></a>
</dt>
<dd><p>A média harm&ocirc;nica, definida como
</p><pre class="example">                  n
               --------
                n
               ====
               \     1
                &gt;    --
               /     x
               ====   i
               i = 1
</pre>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) y : [5, 7, 2, 5, 9, 5, 6, 4, 9, 2, 4, 2, 5]$
(%i4) harmonic_mean (y), numer;
(%o4)                   3.901858027632205
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) harmonic_mean (s2);
(%o6) [6.948015590052786, 7.391967752360356, 9.055658197151745, 
                            13.44199028193692, 13.01439145898509]
</pre>
<p>Veja também as funções <code>mean</code> e <code>geometric_mean</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>geometric_mean</b><i> (<var>lista</var>)</i>
<a name="IDX1434"></a>
</dt>
<dt><u>Função:</u> <b>geometric_mean</b><i> (<var>matriz</var>)</i>
<a name="IDX1435"></a>
</dt>
<dd><p>A média geométrica, definida como
</p><pre class="example">                 /  n      \ 1/n
                 | /===\   |
                 |  ! !    |
                 |  ! !  x |
                 |  ! !   i|
                 | i = 1   |
                 \         /
</pre>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) y : [5, 7, 2, 5, 9, 5, 6, 4, 9, 2, 4, 2, 5]$
(%i4) geometric_mean (y), numer;
(%o4)                   4.454845412337012
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) geometric_mean (s2);
(%o6) [8.82476274347979, 9.22652604739361, 10.0442675714889, 
                            14.61274126349021, 13.96184163444275]
</pre>
<p>Veja também as funções <code>mean</code> e <code>harmonic_mean</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>kurtosis</b><i> (<var>lista</var>)</i>
<a name="IDX1436"></a>
</dt>
<dt><u>Função:</u> <b>kurtosis</b><i> (<var>matriz</var>)</i>
<a name="IDX1437"></a>
</dt>
<dd><p>O coeficiente de curtose, definido como
</p><pre class="example">                    n
                  ====
            1     \          _ 4
           ----    &gt;    (x - x)  - 3
              4   /       i
           n s    ====
                  i = 1
</pre>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) kurtosis (s1), numer;
(%o4)                  - 1.273247946514421
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) kurtosis (s2);
(%o6) [- .2715445622195385, 0.119998784429451, 
   - .4275233490482866, - .6405361979019522, - .4952382132352935]
</pre>
<p>Veja também as funções <code>mean</code>, <code>var</code> e <code>skewness</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>skewness</b><i> (<var>lista</var>)</i>
<a name="IDX1438"></a>
</dt>
<dt><u>Função:</u> <b>skewness</b><i> (<var>matriz</var>)</i>
<a name="IDX1439"></a>
</dt>
<dd><p>O coeficiente de assimetria, definido como
</p><pre class="example">                    n
                  ====
            1     \          _ 3
           ----    &gt;    (x - x)
              3   /       i
           n s    ====
                  i = 1
</pre>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) skewness (s1), numer;
(%o4)                  .009196180476450306
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) skewness (s2);
(%o6) [.1580509020000979, .2926379232061854, .09242174416107717, 
                            .2059984348148687, .2142520248890832]
</pre>
<p>Veja também as funções <code>mean</code>, <code>var</code> e <code>kurtosis</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>pearson_skewness</b><i> (<var>lista</var>)</i>
<a name="IDX1440"></a>
</dt>
<dt><u>Função:</u> <b>pearson_skewness</b><i> (<var>matriz</var>)</i>
<a name="IDX1441"></a>
</dt>
<dd><p>O coeficiente de assimetria de pearson, definido como 
</p><pre class="example">                _
             3 (x - med)
             -----------
                  s
</pre><p>onde <var>med</var> é a mediana de <var>lista</var>.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) pearson_skewness (s1), numer;
(%o4)                   .2159484029093895
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) pearson_skewness (s2);
(%o6) [- .08019976629211892, .2357036272952649, 
         .1050904062491204, .1245042340592368, .4464181795804519]
</pre>
<p>Veja também as funções <code>mean</code>, <code>var</code> e <code>median</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>quartile_skewness</b><i> (<var>lista</var>)</i>
<a name="IDX1442"></a>
</dt>
<dt><u>Função:</u> <b>quartile_skewness</b><i> (<var>matriz</var>)</i>
<a name="IDX1443"></a>
</dt>
<dd><p>O coeficiented de assimetria do quartil, definido como 
</p><pre class="example">               c    - 2 c    + c
                3/4      1/2    1/4
               --------------------
                   c    - c
                    3/4    1/4
</pre><p>onde <em>c_p</em> é o quartil de ordem <var>p</var> da amostra <var>lista</var>.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) quartile_skewness (s1), numer;
(%o4)                  .04761904761904762
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) quartile_skewness (s2);
(%o6) [- 0.0408542246982353, .1467025572005382, 
       0.0336239103362392, .03780068728522298, 0.210526315789474]
</pre>
<p>Veja também a função <code>quantile</code>.
</p></dd></dl>



<hr size="6">
<a name="Defini_00e7_00f5es-espec_00edficas-para-estat_00edstica-descritiva-de-v_00e1rias-vari_00e1veis"></a>
<a name="SEC177"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC176" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC178" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC173" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC173" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC179" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC271" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 44.4 Definições específicas para estatística descritiva de várias variáveis </h2>



<dl>
<dt><u>Função:</u> <b>cov</b><i> (<var>matriz</var>)</i>
<a name="IDX1444"></a>
</dt>
<dd><p>A matriz de covariância da amostra de várias variáveis, definida como
</p><pre class="example">              n
             ====
          1  \           _        _
      S = -   &gt;    (X  - X) (X  - X)'
          n  /       j        j
             ====
             j = 1
</pre><p>onde <em>X_j</em> é a <em>j</em>-ésima linha da matriz de amostra.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) fpprintprec : 7$  /* modifique a precisão para obter uma saída melhor */
(%i5) cov (s2);
      [ 17.22191  13.61811  14.37217  19.39624  15.42162 ]
      [                                                  ]
      [ 13.61811  14.98774  13.30448  15.15834  14.9711  ]
      [                                                  ]
(%o5) [ 14.37217  13.30448  15.47573  17.32544  16.18171 ]
      [                                                  ]
      [ 19.39624  15.15834  17.32544  32.17651  20.44685 ]
      [                                                  ]
      [ 15.42162  14.9711   16.18171  20.44685  24.42308 ]
</pre>
<p>Veja também a função <code>cov1</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>cov1</b><i> (<var>matriz</var>)</i>
<a name="IDX1445"></a>
</dt>
<dd><p>A matriz de covariância da amostra de várias variáveis, definida como
</p><pre class="example">              n
             ====
         1   \           _        _
   S  = ---   &gt;    (X  - X) (X  - X)'
    1   n-1  /       j        j
             ====
             j = 1
</pre><p>where <em>X_j</em> is the <em>j</em>-th row of the sample matrix.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) fpprintprec : 7$ /* modifique a precisão para obter uma saída melhor */
(%i5) cov1 (s2);
      [ 17.39587  13.75567  14.51734  19.59216  15.5774  ]
      [                                                  ]
      [ 13.75567  15.13913  13.43887  15.31145  15.12232 ]
      [                                                  ]
(%o5) [ 14.51734  13.43887  15.63205  17.50044  16.34516 ]
      [                                                  ]
      [ 19.59216  15.31145  17.50044  32.50153  20.65338 ]
      [                                                  ]
      [ 15.5774   15.12232  16.34516  20.65338  24.66977 ]
</pre>
<p>Veja também a função <code>cov</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>global_variances</b><i> (<var>matriz</var>)</i>
<a name="IDX1446"></a>
</dt>
<dt><u>Função:</u> <b>global_variances</b><i> (<var>matriz</var>, <var>valor_lógico</var>)</i>
<a name="IDX1447"></a>
</dt>
<dd><p>A função <code>global_variances</code> retorna uma lista de medidas de variância global:
</p>
<ul>
<li>
<var>variância total</var>: <code>trace(S_1)</code>,
</li><li>
<var>variância média</var>: <code>trace(S_1)/p</code>,
</li><li>
<var>variância generalizada</var>: <code>determinant(S_1)</code>,
</li><li>
<var>desvio padrão generalizado</var>: <code>sqrt(determinant(S_1))</code>,
</li><li>
<var>variância efectiva</var> <code>determinant(S_1)^(1/p)</code>, (defined in: Peña, D. (2002) <var>Análisis de datos multivariantes</var>; McGraw-Hill, Madrid.)
</li><li>
<var>desvio padrão efectivo</var>: <code>determinant(S_1)^(1/(2*p))</code>.
</li></ul>
<p>onde <var>p</var> é a dimensão das várias variáveis aleatórias e <em>S_1</em> a matriz de covariância retornada por <code>cov1</code>.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) global_variances (s2);
(%o4) [105.338342060606, 21.06766841212119, 12874.34690469686, 
         113.4651792608502, 6.636590811800794, 2.576158149609762]
</pre>
<p>A função <code>global_variances</code> tem um argumento lógico opcional: <code>global_variances(x,true)</code> diz ao Maxima que <code>x</code> é a matriz de dados, fazendo o mesmo que <code>global_variances(x)</code>. Por outro lado, <code>global_variances(x,false)</code> significa que <code>x</code> não é a matriz de dados, mas a matriz de covariância, evitando a repetição seu cálculo,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) s : cov1 (s2)$
(%i5) global_variances (s, false);
(%o5) [105.338342060606, 21.06766841212119, 12874.34690469686, 
         113.4651792608502, 6.636590811800794, 2.576158149609762]
</pre>
<p>Veja também <code>cov</code> e <code>cov1</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>cor</b><i> (<var>matriz</var>)</i>
<a name="IDX1448"></a>
</dt>
<dt><u>Função:</u> <b>cor</b><i> (<var>matriz</var>, <var>valor_lógico</var>)</i>
<a name="IDX1449"></a>
</dt>
<dd><p>A matriz de correlação da maostra de várias variáveis.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) fpprintprec:7$
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) cor (s2);
      [   1.0     .8476339  .8803515  .8239624  .7519506 ]
      [                                                  ]
      [ .8476339    1.0     .8735834  .6902622  0.782502 ]
      [                                                  ]
(%o5) [ .8803515  .8735834    1.0     .7764065  .8323358 ]
      [                                                  ]
      [ .8239624  .6902622  .7764065    1.0     .7293848 ]
      [                                                  ]
      [ .7519506  0.782502  .8323358  .7293848    1.0    ]
</pre>
<p>A função <code>cor</code> tem um argumento lógico opcional: <code>cor(x,true)</code> diz ao Maxima que <code>x</code> é a matriz de dados, fazendo o mesmo que <code>cor(x)</code>. Por outro lado, <code>cor(x,false)</code> significa que <code>x</code> não é a matriz de dados, mas a matriz de covariância, evitando a repetição de seu cálculo,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) fpprintprec:7$
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) s : cov1 (s2)$
(%i6) cor (s, false); /* this is faster */
      [   1.0     .8476339  .8803515  .8239624  .7519506 ]
      [                                                  ]
      [ .8476339    1.0     .8735834  .6902622  0.782502 ]
      [                                                  ]
(%o6) [ .8803515  .8735834    1.0     .7764065  .8323358 ]
      [                                                  ]
      [ .8239624  .6902622  .7764065    1.0     .7293848 ]
      [                                                  ]
      [ .7519506  0.782502  .8323358  .7293848    1.0    ]
</pre>
<p>Veja também <code>cov</code> e <code>cov1</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>list_correlations</b><i> (<var>matriz</var>)</i>
<a name="IDX1450"></a>
</dt>
<dt><u>Função:</u> <b>list_correlations</b><i> (<var>matriz</var>, <var>valor_lógico</var>)</i>
<a name="IDX1451"></a>
</dt>
<dd><p>A função <code>list_correlations</code> retorna uma lista de medidas de correlação:
</p>
<ul>
<li>
<var>matriz de precisão</var>: o inverso da matriz de covariância <em>S_1</em>,
<pre class="example">       -1     ij
      S   = (s  )             
       1         i,j = 1,2,...,p
</pre>
</li><li>
<var>vector de correlação múltipla</var>:  <em>(R_1^2, R_2^2, ..., R_p^2)</em>, com 
<pre class="example">       2          1
      R  = 1 - -------
       i        ii
               s   s
                    ii
</pre><p>sendo um indicador do melhor do ajuste do modelo de regressão linear de várias variáveis dobre <em>X_i</em> quando o resto das variáveis são usados como regressores.
</p>
</li><li>
<var>matriz de correlação parcial</var>: como elemento <em>(i, j)</em> sendo
<pre class="example">                         ij
                        s
      r        = - ------------
       ij.rest     / ii  jj\ 1/2
                   |s   s  |
                   \       /
</pre>
</li></ul>

<p>Exemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) z : list_correlations (s2)$
(%i5) fpprintprec : 5$ /* for pretty output */
(%i6) z[1];  /* precision matrix */
      [  .38486   - .13856   - .15626   - .10239    .031179  ]
      [                                                      ]
      [ - .13856   .34107    - .15233    .038447   - .052842 ]
      [                                                      ]
(%o6) [ - .15626  - .15233    .47296    - .024816  - .10054  ]
      [                                                      ]
      [ - .10239   .038447   - .024816   .10937    - .034033 ]
      [                                                      ]
      [ .031179   - .052842  - .10054   - .034033   .14834   ]
(%i7) z[2];  /* multiple correlation vector */
(%o7)       [.85063, .80634, .86474, .71867, .72675]
(%i8) z[3];  /* partial correlation matrix */
       [  - 1.0     .38244   .36627   .49908   - .13049 ]
       [                                                ]
       [  .38244    - 1.0    .37927  - .19907   .23492  ]
       [                                                ]
(%o8)  [  .36627    .37927   - 1.0    .10911    .37956  ]
       [                                                ]
       [  .49908   - .19907  .10911   - 1.0     .26719  ]
       [                                                ]
       [ - .13049   .23492   .37956   .26719    - 1.0   ]
</pre>
<p>A função <code>list_correlations</code> também tem um argumento lógico opcional: <code>list_correlations(x,true)</code> diz ao Maxima que <code>x</code> é a matriz de dados, fazendo o mesmo que <code>list_correlations(x)</code>. Por outro lado, <code>list_correlations(x,false)</code> significa que <code>x</code> não é a matriz de correlação, mas a matriz de covariancia, evitando a repetição de seu cálculo.
</p>
<p>Veja também <code>cov</code> e <code>cov1</code>.
</p></dd></dl>



<hr size="6">
<a name="Defini_00e7_00f5es-para-gr_00e1ficos-estat_00edsticos"></a>
<a name="SEC178"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC177" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC179" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC173" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC173" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC179" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC271" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 44.5 Definições para gráficos estatísticos </h2>



<dl>
<dt><u>Função:</u> <b>dataplot</b><i> (<var>lista</var>)</i>
<a name="IDX1452"></a>
</dt>
<dt><u>Função:</u> <b>dataplot</b><i> (<var>lista</var>, <var>opção_1</var>, <var>opção_2</var>, ...)</i>
<a name="IDX1453"></a>
</dt>
<dt><u>Função:</u> <b>dataplot</b><i> (<var>matriz</var>)</i>
<a name="IDX1454"></a>
</dt>
<dt><u>Função:</u> <b>dataplot</b><i> (<var>matriz</var>, <var>opção_1</var>, <var>opção_2</var>, ...)</i>
<a name="IDX1455"></a>
</dt>
<dd><p>A função <code>dataplot</code> permite visualização directa de dados de amostra, ambas d uma única variável (<var>lista</var>) e de várias variáveis (<var>matriz</var>). Fornecendo valores para as seguintes <var>opções</var> que são alguns aspéctos de impressão que podem ser controlados:
</p>
<ul>
<li>
<code>'outputdev</code>, o valor padrão é <code>&quot;x&quot;</code>, indica o formato de dispositivo/ficheiro da figura de saída; valores correctos são <code>&quot;x&quot;</code>, <code>&quot;eps&quot;</code> e <code>&quot;png&quot;</code>, para a tela, formato de ficheiro postscript e formato de ficheiro png, respectivamente.

</li><li>
<code>'maintitle</code>, o valor padrão é <code>&quot;&quot;</code>, é o título principal entre aspas duplas.

</li><li>
<code>'axisnames</code>, o valor padrão é <code>[&quot;x&quot;,&quot;y&quot;,&quot;z&quot;]</code>, é uma lista de nomes dos eixos <code>x</code>, <code>y</code> e <code>z</code>.

</li><li>
<code>'joined</code>, o valor padrão é <code>false</code>, um valor lógico para seleccionar pontos em 2D para serem unidos ou isolados.

</li><li>
<code>'picturescales</code>, o valor padrão é <code>[1.0, 1.0]</code>, factor de proporcionalidade para o tamanho do gráfico.

</li><li>
<code>'threedim</code>, o valor padrão é <code>true</code>, diz ao Maxima se ou monta-se o gráfico de uma matriz de três colunas como um diagrama 3D ou se monta-se o gráfico como um diagrama de dispersão de várias variáveis. Veja exemplos abaixo.

</li><li>
<code>'axisrot</code>, o valor padrão é <code>[60, 30]</code>, modifica o ponto de visualização quando <code>'threedim</code> for escolhido para <code>true</code> dados forem armazenados em uma matriz de três colunas. O primeiro número é o ângulo de rotação do eixo <var>x</var>, e o segundo número é o angulo de rotação do eixo <var>z</var>-axis, ambas as medidas em graus.

</li><li>
<code>'nclasses</code>, o valor padrão é <code>10</code>, é o número de classes para histogramas na diagonal de gráficos de dispersão de várias variáveis.

</li><li>
<code>'pointstyle</code>, o valor padrão é <code>1</code>, é um inteiro que indica como mostrar pontos de amostra.

</li></ul>

<p>Por exemplo, com a seguite entrada um gráfico simples dos primeiros vinte dígitos de <code>%pi</code> é requisitado e a saída é armazenada em um ficheiro no formato eps.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) dataplot (makelist (s1[k], k, 1, 20), 'pointstyle = 3)$
</pre>
<p>Note que dados unidimensionais são colocados no gráfico como uma série de tempo. No caso seguinte, ocorre a mesma coisa só que com mais dados e com mais configurações,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) dataplot (makelist (s1[k], k, 1, 50), 'maintitle = &quot;Primeiros dígitos de pi&quot;,
 'axisnames = [&quot;ordem do dígito&quot;, &quot;valor do dígito&quot;], 'pointstyle = 2,
 'joined = true)$
</pre>
<p>A função <code>dataplot</code> pode ser usada para montar gráficos de pontos no plano. O exemplo seguinte é gráfico de dispersão de pares de pontos de velocidades de vento para o primeira e para o quinta estação meteorológica,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) dataplot (submatrix (s2, 2, 3, 4), 'pointstyle = 2,
 'maintitle = &quot;Pares de medidas de velocidade do vento em nós&quot;,
 'axisnames = [&quot;Velocidade do vento em A&quot;, &quot;Velocidade do vento em E&quot;])$
</pre>
<p>Se pontos forem armazenados em uma matriz de duas colunas, <code>dataplot</code> pode montar o gráfico desses pontos directamente, mas se eles forem formatados em uma lista de pares, essa lista deve ser transformada em uma matriz como no seguinte exemplo.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) x : [[-1, 2], [5, 7], [5, -3], [-6, -9], [-4, 6]]$
(%i3) dataplot (apply ('matrix, x), 'maintitle = &quot;Pontos&quot;,
 'joined = true, 'axisnames = [&quot;&quot;, &quot;&quot;], 'picturescales = [0.5, 1.0])$
</pre>
<p>Pontos no espaço tridimensional podem ser vistos como uma projeção no plano. Nesse exemplo, o gráfico de velocidades do vento correspondendo a três estações meteorológicas são requisitados, primeiramente em um gráfico em 3D e a seguir em um gráfico de dispersào de várias variáveis.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) /* 3D plot */ dataplot (submatrix (s2, 4, 5), 'pointstyle = 2,
 'maintitle = &quot;Pares de medidas de velocidades do vento em nós&quot;,
 'axisnames = [&quot;Estação A&quot;, &quot;Estação B&quot;, &quot;Estação C&quot;])$
(%i5) /* Gráfico de dispersão de várias variáveis */ dataplot (submatrix (s2, 4, 5),
 'nclasses = 6, 'threedim = false)$
</pre><p>Note que no último exemplo, o número de classes no histogramas da diagonal é escolhido para 6, e aquela opção <code>'threedim</code> for escolhida para <code>false</code>.
</p>
<p>Para mais que três dimensões somente gráficos de dispersão de várias variáveis são possível, como em
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) dataplot (s2)$
</pre></dd></dl>



<dl>
<dt><u>Função:</u> <b>histogram</b><i> (<var>lista</var>)</i>
<a name="IDX1456"></a>
</dt>
<dt><u>Função:</u> <b>histogram</b><i> (<var>lista</var>, <var>opção_1</var>, <var>opção_2</var>, ...)</i>
<a name="IDX1457"></a>
</dt>
<dt><u>Função:</u> <b>histogram</b><i> (<var>one_column_matrix</var>)</i>
<a name="IDX1458"></a>
</dt>
<dt><u>Função:</u> <b>histogram</b><i> (<var>one_column_matrix</var>, <var>opção_1</var>, <var>opção_2</var>, ...)</i>
<a name="IDX1459"></a>
</dt>
<dd><p>Essa função monta um gráfico de um histograma. Dados de amostras devem ser armazenados em uma lista de números ou em uma matriz de uma coluna. Fornecendo valores para as seguintes <var>opções</var> alguns aspéctos do gráfico podem ser controlados:
</p>
<ul>
<li>
<code>'outputdev</code>, o valor padrão é <code>&quot;x&quot;</code>, indica o formato de ficheiro da figura de saída; valores correctos são <code>&quot;x&quot;</code>, <code>&quot;eps&quot;</code> e <code>&quot;png&quot;</code>, para a tela, formato de ficheiro postscript e formato de ficheiro png, respectivamente.

</li><li>
<code>'maintitle</code>, o valor padrão é <code>&quot;&quot;</code>, é o título principal entre aspas duplas.

</li><li>
<code>'axisnames</code>, o valor padrão é <code>[&quot;x&quot;, &quot;Fr.&quot;]</code>, é uma lista de nomes dos eixos <code>x</code> e <code>y</code>.

</li><li>
<code>'picturescales</code>, o valor padrão é <code>[1.0, 1.0]</code>, factor de proporcionalidade para o tamanho do gráfico.

</li><li>
<code>'nclasses</code>, o valor padrão é <code>10</code>, é o número de classes ou o número de barras.

</li><li>
<code>'relbarwidth</code>, o valor padrão é <code>0.9</code>, um número decimao entre 0 e 1 para controlar a largura das barras.

</li><li>
<code>'barcolor</code>, o valor padrão é <code>1</code>, um inteiro para indicar a cor das barras.

</li><li>
<code>'colorintensity</code>, o valor padrão é <code>1</code>, um número decimal entre 0 e 1 para estabelecer a intensidade da cor.

</li></ul>

<p>Nos próximos dois exemplos, histogramas são requisitados para os primeiros 100 dígitos do número <code>%pi</code> e para velocidades do vento na terceira estação meteorológica.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i4) histogram (s1, 'maintitle = &quot;dígitos de pi&quot;, 'axisnames = [&quot;&quot;, &quot;Frequência absoluta&quot;],
 'relbarwidth = 0.2, 'barcolor = 3, 'colorintensity = 0.6)$
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) histogram (col (s2, 3), 'colorintensity = 0.3)$
</pre><p>Note tque no primeiro caso, <code>s1</code> é uma lista  e o segundo exemplo, <code>col(s2,3)</code> é uma matriz.
</p>
<p>Veja também a função <code>barsplot</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>barsplot</b><i> (<var>lista</var>)</i>
<a name="IDX1460"></a>
</dt>
<dt><u>Função:</u> <b>barsplot</b><i> (<var>lista</var>, <var>opção_1</var>, <var>opção_2</var>, ...)</i>
<a name="IDX1461"></a>
</dt>
<dt><u>Função:</u> <b>barsplot</b><i> (<var>one_column_matrix</var>)</i>
<a name="IDX1462"></a>
</dt>
<dt><u>Função:</u> <b>barsplot</b><i> (<var>one_column_matrix</var>, <var>opção_1</var>, <var>opção_2</var>, ...)</i>
<a name="IDX1463"></a>
</dt>
<dd><p>Similar a <code>histogram</code> mas para variáveis estatísticas, numéricas ou divididas em categorias. As opções estão abaixo,
</p>
<ul>
<li>
<code>'outputdev</code>, o valor padrão é <code>&quot;x&quot;</code>, indica o formato de ficheiro da figura de saída; valores correctos são <code>&quot;x&quot;</code>, <code>&quot;eps&quot;</code> e <code>&quot;png&quot;</code>, para a tela, formato de ficheiro postscript e formato de ficheiro png, respectivamente.

</li><li>
<code>'maintitle</code>, o valor padrão é <code>&quot;&quot;</code>, é o título principal entre aspas duplas.

</li><li>
<code>'axisnames</code>, o valor padrão é <code>[&quot;x&quot;, &quot;Fr.&quot;]</code>, é uma lista de nomes dos eixos <code>x</code> e <code>y</code>.

</li><li>
<code>'picturescales</code>, o valor padrão é <code>[1.0, 1.0]</code>, factor de proporcionalidade para o tamanho do gráfico.

</li><li>
<code>'relbarwidth</code>, o valor padrão é <code>0.9</code>, um número decimao entre 0 e 1 para controlar a largura das barras.

</li><li>
<code>'barcolor</code>, o valor padrão é <code>1</code>, um inteiro para indicar a cor das barras.

</li><li>
<code>'colorintensity</code>, o valor padrão é <code>1</code>, um número decimal entre 0 e 1 para estabelecer a intensidade da cor.


</li></ul>

<p>Esse exemplo monta um gráfico de barras para os grupos <code>A</code> e <code>B</code> de pacientes na amostra <code>s3</code>,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i4) barsplot (col (s3, 1), 'maintitle = &quot;Grupos de pacientes&quot;,
 'axisnames = [&quot;Grupo&quot;, &quot;# de indivíduos&quot;], 'colorintensity = 0.2)$
</pre><p>A primeira coluna na amostra <code>s3</code> armazena os valores das categorias <code>A</code> e <code>B</code>, também conhecidos algumas vezes como factores. Por outro lado, os números inteiros positivos na segunda coluna sào idades, em anos, que se comportam como variável discreta, então podemos montar um gráfico as freqyuências absolutas para esses valores,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i4) barsplot (col (s3, 2), 'maintitle = &quot;Idades&quot;,
 'axisnames = [&quot;Anos&quot;, &quot;# dos indivíduos&quot;], 'colorintensity = 0.2,
 'relbarwidth = 0.6)$
</pre>

<p>Veja também a função <code>histogram</code>.
</p></dd></dl>



<dl>
<dt><u>Função:</u> <b>boxplot</b><i> (<var>data</var>)</i>
<a name="IDX1464"></a>
</dt>
<dt><u>Função:</u> <b>boxplot</b><i> (<var>data</var>, <var>opção_1</var>, <var>opção_2</var>, ...)</i>
<a name="IDX1465"></a>
</dt>
<dd><p>Essa função monta diagramas em caixas. O argumento <var>data</var> pode ser uma lista, que não é de grande interesse, uma vez que esses diagramas são principalmente usados para comparação entre diferentes amostras, ou uma matriz, eentão é possível comparar dois ou mais componentes de uma variável estatística de várias variáveis. Mas é também permitido <var>data</var> se uma lista de amostras com tamanhos diferentes de amostra, de facto essa é aa única função no pacote <code>descriptive</code> que admite esse tipo de estrutura de dados. Veja o exemplo abaixo.  Abaixo etão as opções,
</p>
<ul>
<li>
<code>'outputdev</code>, o valor padrão é <code>&quot;x&quot;</code>, indica o formato de ficheiro da figura de saída; valores correctos são <code>&quot;x&quot;</code>, <code>&quot;eps&quot;</code> e <code>&quot;png&quot;</code>, para a tela, formato de ficheiro postscript e formato de ficheiro png, respectivamente.

</li><li>
<code>'maintitle</code>, o valor padrão é <code>&quot;&quot;</code>, é o título principal entre aspas duplas.

</li><li>
<code>'axisnames</code>, o valor padrão é <code>[&quot;sample&quot;, &quot;y&quot;]</code>, é uma lista de nomes dos eixos <code>x</code> e <code>y</code>.

</li><li>
<code>'picturescales</code>, o valor padrão é <code>[1.0, 1.0]</code>, factor de proporcionalidade para o tamanho do gráfico.

</li></ul>

<p>Examples:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) boxplot (s2, 'maintitle = &quot;Velocidade do vento em nós&quot;,
 'axisnames = [&quot;Estação do ano&quot;, &quot;&quot;])$
(%i5) A :
 [[6, 4, 6, 2, 4, 8, 6, 4, 6, 4, 3, 2],
  [8, 10, 7, 9, 12, 8, 10],
  [16, 13, 17, 12, 11, 18, 13, 18, 14, 12]]$
(%i6) boxplot (A)$
</pre></dd></dl>


<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC173" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC179" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC271" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>Dezembro, 9 2014</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
