<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on Dezembro, 9 2014 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual do Maxima 5.35.0: 31. Teoria dos Números</title>

<meta name="description" content="Manual do Maxima 5.35.0: 31. Teoria dos Números">
<meta name="keywords" content="Manual do Maxima 5.35.0: 31. Teoria dos Números">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}

-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="pt" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Teoria-dos-N_00fameros"></a>
<a name="SEC123"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_30.html#SEC122" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC124" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_30.html#SEC120" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_32.html#SEC125" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC271" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 31. Teoria dos Números </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC124">31.1 Definições para Teoria dos Números</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
</table>

<hr size="6">
<a name="Defini_00e7_00f5es-para-Teoria-dos-N_00fameros"></a>
<a name="SEC124"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC123" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_32.html#SEC125" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC123" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC123" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_32.html#SEC125" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC271" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 31.1 Definições para Teoria dos Números </h2>

<dl>
<dt><u>Função:</u> <b>bern</b><i> (<var>n</var>)</i>
<a name="IDX1042"></a>
</dt>
<dd><p>Retorna o <var>n</var>'ésimo número de Bernoulli para o inteiro <var>n</var>.
Números de Bernoulli iguais a zero são suprimidos se <code>zerobern</code> for <code>false</code>.
</p>
<p>Veja também <code>burn</code>.
</p>
<pre class="example">(%i1) zerobern: true$
(%i2) map (bern, [0, 1, 2, 3, 4, 5, 6, 7, 8]);
                  1  1       1      1        1
(%o2)       [1, - -, -, 0, - --, 0, --, 0, - --]
                  2  6       30     42       30
(%i3) zerobern: false$
(%i4) map (bern, [0, 1, 2, 3, 4, 5, 6, 7, 8]);
            1  1    1   5     691   7    3617  43867
(%o4) [1, - -, -, - --, --, - ----, -, - ----, -----]
            2  6    30  66    2730  6    510    798
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>bernpoly</b><i> (<var>x</var>, <var>n</var>)</i>
<a name="IDX1043"></a>
</dt>
<dd><p>Retorna o <var>n</var>'ésimo polinómio de Bernoulli na
variável <var>x</var>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>bfzeta</b><i> (<var>s</var>, <var>n</var>)</i>
<a name="IDX1044"></a>
</dt>
<dd><p>Retorna a função zeta de Riemann para o argumento <var>s</var>.
O valor de retorno é um grande inteiro em ponto flutuante (bfloat);
<var>n</var> é o número de dígitos no valor de retorno.
</p>
<p><code>load (&quot;bffac&quot;)</code> chama essa função.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>bfhzeta</b><i> (<var>s</var>, <var>h</var>, <var>n</var>)</i>
<a name="IDX1045"></a>
</dt>
<dd><p>Retorna a função zeta de Hurwitz para os argumentos <var>s</var> e <var>h</var>.
O valor de retorno é um grande inteiro em ponto flutuante (bfloat);
<var>n</var> é o números de dígitos no valor de retorno.
</p>
<p>A função zeta de Hurwitz é definida como
</p>
<pre class="example">sum ((k+h)^-s, k, 0, inf)
</pre>
<p><code>load (&quot;bffac&quot;)</code> chama essa função.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>binomial</b><i> (<var>x</var>, <var>y</var>)</i>
<a name="IDX1046"></a>
</dt>
<dd><p>O coeficiente binomial <code><var>x</var>!/(<var>y</var>! (<var>x</var> - <var>y</var>)!)</code>.
Se <var>x</var> e <var>y</var> forem inteiros, então o valor numérico do coeficiente
binomial é calculado.
Se <var>y</var>, ou <var>x - y</var>, for um inteiro,
o the coeficiente binomial é expresso como um polinómio.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) binomial (11, 7);
(%o1)                          330
(%i2) 11! / 7! / (11 - 7)!;
(%o2)                          330
(%i3) binomial (x, 7);
        (x - 6) (x - 5) (x - 4) (x - 3) (x - 2) (x - 1) x
(%o3)   -------------------------------------------------
                              5040
(%i4) binomial (x + 7, x);
      (x + 1) (x + 2) (x + 3) (x + 4) (x + 5) (x + 6) (x + 7)
(%o4) -------------------------------------------------------
                               5040
(%i5) binomial (11, y);
(%o5)                    binomial(11, y)
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>burn</b><i> (<var>n</var>)</i>
<a name="IDX1047"></a>
</dt>
<dd><p>Retorna o <var>n</var>'ésimo número de Bernoulli para o inteiro <var>n</var>.
<code>burn</code> pode ser mais eficitente que <code>bern</code> para valores grandes e isolados de <var>n</var>
(talvez <var>n</var> maior que 105 ou algo parecido), como <code>bern</code> calcula todos os números de Bernoulli até o índice <var>n</var> antes de retornar.
</p>

<p><code>burn</code> explora a observação que números de Bernoulli (racionais) podem ser
aproximados através de zetas (transcendentes) com eficiência tolerável.
</p>
<p><code>load (&quot;bffac&quot;)</code> chama essa função.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>cf</b><i> (<var>expr</var>)</i>
<a name="IDX1048"></a>
</dt>
<dd><p>Converte <var>expr</var> em uma fração contínua.
<var>expr</var> é uma expressão
compreendendo frações contínuas e raízes quadradas de inteiros.
Operandos na expressão podem ser combinados com operadores aritméticos.
Com excessão de frações contínuas e raízes quadradas,
factores na expressão devem ser números inteiros ou racionais.
Maxima não conhece operações sobre frações contínuas fora de <code>cf</code>.
</p>
<p><code>cf</code> avalia seus argumentos após associar <code>listarith</code> a <code>false</code>.
<code>cf</code> retorna uma fração contínua, representada como uma lista.
</p>
<p>Uma fração contínua <code>a + 1/(b + 1/(c + ...))</code>
é representada através da lista <code>[a, b, c, ...]</code>.
Os elementos da lista <code>a</code>, <code>b</code>, <code>c</code>, ... devem avaliar para inteiros. 
<var>expr</var> pode também conter <code>sqrt (n)</code> onde <code>n</code> é um inteiro.
Nesse caso <code>cf</code> fornecerá tantos
termos de fração contínua quantos forem o valor da variável
<code>cflength</code> vezes o período.
</p>
<p>Uma fração contínua pode ser avaliada para um número
através de avaliação da representação aritmética
retornada por <code>cfdisrep</code>.
Veja também <code>cfexpand</code> para outro caminho para avaliar uma fração contínua.
</p>
<p>Veja também <code>cfdisrep</code>, <code>cfexpand</code>, e <code>cflength</code>.
</p>
<p>Exemplos:
</p>
<ul>
<li>
<var>expr</var> é uma expressão compreendendo frações contínuas e raízes quadradas de inteiros.

<pre class="example">(%i1) cf ([5, 3, 1]*[11, 9, 7] + [3, 7]/[4, 3, 2]);
(%o1)               [59, 17, 2, 1, 1, 1, 27]
(%i2) cf ((3/17)*[1, -2, 5]/sqrt(11) + (8/13));
(%o2)        [0, 1, 1, 1, 3, 2, 1, 4, 1, 9, 1, 9, 2]
</pre>
</li><li>
<code>cflength</code> controla quantos períodos de fração contínua
são computados para números algébricos, números irracionais.

<pre class="example">(%i1) cflength: 1$
(%i2) cf ((1 + sqrt(5))/2);
(%o2)                    [1, 1, 1, 1, 2]
(%i3) cflength: 2$
(%i4) cf ((1 + sqrt(5))/2);
(%o4)               [1, 1, 1, 1, 1, 1, 1, 2]
(%i5) cflength: 3$
(%i6) cf ((1 + sqrt(5))/2);
(%o6)           [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
</pre>
</li><li>
Um fração contínua pode ser avaliado através da avaliação da representação aritmética
retornada por <code>cfdisrep</code>.

<pre class="example">(%i1) cflength: 3$
(%i2) cfdisrep (cf (sqrt (3)))$
(%i3) ev (%, numer);
(%o3)                   1.731707317073171
</pre>
</li><li>
Maxima não conhece operações sobre frações contínuas fora de <code>cf</code>.

<pre class="example">(%i1) cf ([1,1,1,1,1,2] * 3);
(%o1)                     [4, 1, 5, 2]
(%i2) cf ([1,1,1,1,1,2]) * 3;
(%o2)                  [3, 3, 3, 3, 3, 6]
</pre>
</li></ul>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>cfdisrep</b><i> (<var>list</var>)</i>
<a name="IDX1049"></a>
</dt>
<dd><p>Constrói e retorna uma expressão aritmética comum
da forma <code>a + 1/(b + 1/(c + ...))</code>
a partir da representação lista de uma fração contínua <code>[a, b, c, ...]</code>.
</p>
<pre class="example">(%i1) cf ([1, 2, -3] + [1, -2, 1]);
(%o1)                     [1, 1, 1, 2]
(%i2) cfdisrep (%);
                                  1
(%o2)                     1 + ---------
                                    1
                              1 + -----
                                      1
                                  1 + -
                                      2
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>cfexpand</b><i> (<var>x</var>)</i>
<a name="IDX1050"></a>
</dt>
<dd><p>Retorna uma matriz de numeradores e denominadores dos
último (columa 1) e penúltimo (columa 2) convergentes da fração contínua <var>x</var>.
</p>
<pre class="example">(%i1) cf (rat (ev (%pi, numer)));

`rat' replaced 3.141592653589793 by 103993/33102 = 3.141592653011902
(%o1)                  [3, 7, 15, 1, 292]
(%i2) cfexpand (%); 
                         [ 103993  355 ]
(%o2)                    [             ]
                         [ 33102   113 ]
(%i3) %[1,1]/%[2,1], numer;
(%o3)                   3.141592653011902
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>cflength</b>
<a name="IDX1051"></a>
</dt>
<dd><p>Valor por omissão: 1
</p>
<p><code>cflength</code> controla o número de termos da fração
contínua que a função <code>cf</code> fornecerá, como o valor de <code>cflength</code> vezes o
período.  Dessa forma o padrão é fornecer um período.
</p>
<pre class="example">(%i1) cflength: 1$
(%i2) cf ((1 + sqrt(5))/2);
(%o2)                    [1, 1, 1, 1, 2]
(%i3) cflength: 2$
(%i4) cf ((1 + sqrt(5))/2);
(%o4)               [1, 1, 1, 1, 1, 1, 1, 2]
(%i5) cflength: 3$
(%i6) cf ((1 + sqrt(5))/2);
(%o6)           [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>divsum</b><i> (<var>n</var>, <var>k</var>)</i>
<a name="IDX1052"></a>
</dt>
<dt><u>Função:</u> <b>divsum</b><i> (<var>n</var>)</i>
<a name="IDX1053"></a>
</dt>
<dd><p><code>divsum (<var>n</var>, <var>k</var>)</code> retorna a adição dos divisores de <var>n</var>
elevados à <var>k</var>'ésima potência.
</p>
<p><code>divsum (<var>n</var>)</code> retorna a adição dos divisores de <var>n</var>.
</p>
<pre class="example">(%i1) divsum (12);
(%o1)                          28
(%i2) 1 + 2 + 3 + 4 + 6 + 12;
(%o2)                          28
(%i3) divsum (12, 2);
(%o3)                          210
(%i4) 1^2 + 2^2 + 3^2 + 4^2 + 6^2 + 12^2;
(%o4)                          210
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>euler</b><i> (<var>n</var>)</i>
<a name="IDX1054"></a>
</dt>
<dd><p>Retorna o <var>n</var>'ésimo número de Euler para o inteiro <var>n</var> não negativo.
</p>
<p>Para a constante de Euler-Mascheroni, veja <code>%gamma</code>.
</p>
<pre class="example">(%i1) map (euler, [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o1)    [1, 0, - 1, 0, 5, 0, - 61, 0, 1385, 0, - 50521]
</pre>
</dd></dl>

<dl>
<dt><u>Constante:</u> <b>%gamma</b>
<a name="IDX1055"></a>
</dt>
<dd><p>A constante de Euler-Mascheroni, 0.5772156649015329 ....
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>factorial</b><i> (<var>x</var>)</i>
<a name="IDX1056"></a>
</dt>
<dd><p>Representa a função factorial. Maxima trata <code>factorial (<var>x</var>)</code> da mesma forma que <code><var>x</var>!</code>.
Veja <code>!</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>fib</b><i> (<var>n</var>)</i>
<a name="IDX1057"></a>
</dt>
<dd><p>Retorna o <var>n</var>'ésimo número de Fibonacci.
<code>fib(0)</code> igual a 0 e <code>fib(1)</code> igual a 1,
e
<code>fib (-<var>n</var>)</code> igual a <code>(-1)^(<var>n</var> + 1) * fib(<var>n</var>)</code>.
</p>
<p>Após chamar <code>fib</code>,
<code>prevfib</code> é iguala <code>fib (<var>x</var> - 1)</code>,
o número de Fibonacci anterior ao último calculado.
</p>
<pre class="example">(%i1) map (fib, [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o1)         [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55]
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>fibtophi</b><i> (<var>expr</var>)</i>
<a name="IDX1058"></a>
</dt>
<dd><p>Expressa números de Fibonacci que aparecem em <var>expr</var> em termos da constante <code>%phi</code>,
que é <code>(1 + sqrt(5))/2</code>, aproximadamente 1.61803399.
</p>
<p>Exemplos:
</p> 

<pre class="example">(%i1) fibtophi (fib (n));
                           n             n
                       %phi  - (1 - %phi)
(%o1)                  -------------------
                           2 %phi - 1
(%i2) fib (n-1) + fib (n) - fib (n+1);
(%o2)          - fib(n + 1) + fib(n) + fib(n - 1)
(%i3) fibtophi (%);
            n + 1             n + 1       n             n
        %phi      - (1 - %phi)        %phi  - (1 - %phi)
(%o3) - --------------------------- + -------------------
                2 %phi - 1                2 %phi - 1
                                          n - 1             n - 1
                                      %phi      - (1 - %phi)
                                    + ---------------------------
                                              2 %phi - 1
(%i4) ratsimp (%);
(%o4)                           0
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>ifactors</b><i> (<var>n</var>)</i>
<a name="IDX1059"></a>
</dt>
<dd><p>Para um inteiro positivo <var>n</var> retorna a factoração de <var>n</var>. Se
<code>n=p1^e1..pk^nk</code> for a decomposição de <var>n</var> em factores
primos, <code>ifactors</code> retorna <code>[[p1, e1], ... , [pk, ek]]</code>.
</p>
<p>Os métodos de factoração usados são divisões triviais por primos até 9973,
o método rho de Pollard e o método da curva elíptica.
</p>
<pre class="example">(%i1) ifactors(51575319651600);
(%o1)     [[2, 4], [3, 2], [5, 2], [1583, 1], [9050207, 1]]
(%i2) apply(&quot;*&quot;, map(lambda([u], u[1]^u[2]), %));
(%o2)                        51575319651600
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>inrt</b><i> (<var>x</var>, <var>n</var>)</i>
<a name="IDX1060"></a>
</dt>
<dd><p>Retorna a parte inteira da <var>n</var>'ésima raíz do valor absoluto de <var>x</var>.
</p>
<pre class="example">(%i1) l: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]$
(%i2) map (lambda ([a], inrt (10^a, 3)), l);
(%o2) [2, 4, 10, 21, 46, 100, 215, 464, 1000, 2154, 4641, 10000]
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>inv_mod</b><i> (<var>n</var>, <var>m</var>)</i>
<a name="IDX1061"></a>
</dt>
<dd><p>Calcula o  inverso de <var>n</var> módulo <var>m</var>. 
<code>inv_mod (n,m)</code> retorna <code>false</code>, 
se <var>n</var> modulo <var>m</var> for zero.
</p>
<pre class="example">(%i1) inv_mod(3, 41);
(%o1)                           14
(%i2) ratsimp(3^-1), modulus=41;
(%o2)                           14
(%i3) inv_mod(3, 42);
(%o3)                          false
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>jacobi</b><i> (<var>p</var>, <var>q</var>)</i>
<a name="IDX1062"></a>
</dt>
<dd><p>Retorna símbolo de Jacobi de <var>p</var> e <var>q</var>.
</p>
<pre class="example">(%i1) l: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]$
(%i2) map (lambda ([a], jacobi (a, 9)), l);
(%o2)         [1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0]
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>lcm</b><i> (<var>expr_1</var>, ..., <var>expr_n</var>)</i>
<a name="IDX1063"></a>
</dt>
<dd><p>Retorna o menor múltiplo comum entre seus argumentos.
Os argumentos podem ser expressões gerais também inteiras.
</p>
<p><code>load (&quot;functs&quot;)</code> chama essa função.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>minfactorial</b><i> (<var>expr</var>)</i>
<a name="IDX1064"></a>
</dt>
<dd><p>Examina <var>expr</var> procurando por ocorrências de dois factoriais
que diferem por um inteiro.  
<code>minfactorial</code> então converte um em um polinómio vezes o outro.
</p>

<pre class="example">(%i1) n!/(n+2)!;
                               n!
(%o1)                       --------
                            (n + 2)!
(%i2) minfactorial (%);
                                1
(%o2)                    ---------------
                         (n + 1) (n + 2)
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>next_prime</b><i> (<var>n</var>)</i>
<a name="IDX1065"></a>
</dt>
<dd><p>Retorna o menor primo maior que <var>n</var>.
</p>
<pre class="example">(%i1) next_prime(27);
(%o1)                       29
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>partfrac</b><i> (<var>expr</var>, <var>var</var>)</i>
<a name="IDX1066"></a>
</dt>
<dd><p>Expande a expressão <var>expr</var> em frações parciais
com relação à variável principal <var>var</var>.  <code>partfrac</code> faz uma decomposição
completa de fração parcial.  O algoritmo utilizado é baseado no
facto que os denominadores de uma expansão de fração parcial (os
factores do denominador original) são relativamente primos.  Os
numeradores podem ser escritos como combinação linear dos denominadores, e
a expansão acontece.
</p>
<pre class="example">(%i1) 1/(1+x)^2 - 2/(1+x) + 2/(2+x);
                      2       2        1
(%o1)               ----- - ----- + --------
                    x + 2   x + 1          2
                                    (x + 1)
(%i2) ratsimp (%);
                                 x
(%o2)                 - -------------------
                         3      2
                        x  + 4 x  + 5 x + 2
(%i3) partfrac (%, x);
                      2       2        1
(%o3)               ----- - ----- + --------
                    x + 2   x + 1          2
                                    (x + 1)
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>power_mod</b><i> (<var>a</var>, <var>n</var>, <var>m</var>)</i>
<a name="IDX1067"></a>
</dt>
<dd><p>Usa um algoritmo modular para calcular <code>a^n mod m</code> 
onde <var>a</var> e <var>n</var> são inteiros e <var>m</var> é um inteiro positivo. 
Se <var>n</var> for negativo, <code>inv_mod</code> é usada para encontrar o inverso modular.
</p>
<pre class="example">(%i1) power_mod(3, 15, 5);
(%o1)                          2
(%i2) mod(3^15,5);
(%o2)                          2
(%i3) power_mod(2, -1, 5);
(%o3)                          3
(%i4) inv_mod(2,5);
(%o4)                          3
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>primep</b><i> (<var>n</var>)</i>
<a name="IDX1068"></a>
</dt>
<dd><p>Teste de primalidade. Se <code>primep (n)</code> retornar <code>false</code>, <var>n</var> é um
número compostro e se esse teste retornar <code>true</code>, <var>n</var> é um número primo
com grande probabilidade.
</p>
<p>Para <var>n</var> menor que 341550071728321 uma versão deterministra do teste de 
Miller-Rabin é usada. Se <code>primep (n)</code> retornar <code>true</code>, então <var>n</var> é um
número primo.
</p>
<p>Para <var>n</var> maior que 34155071728321 <code>primep</code> usa
<code>primep_number_of_tests</code> que é os testes de pseudo-primalidade de Miller-Rabin
e um teste de pseudo-primalidade de Lucas. A probabilidade que <var>n</var> irá
passar por um teste de Miller-Rabin é menor que 1/4. Usando o valor padrão 25 para
<code>primep_number_of_tests</code>, a probabilidade de <var>n</var> passar no teste sendo
composto é muito menor que 10^-15.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>primep_number_of_tests</b>
<a name="IDX1069"></a>
</dt>
<dd><p>Valor por omissão: 25
</p>
<p>Número de testes de Miller-Rabin usados em <code>primep</code>.
</p></dd></dl>

<dl>
<dt><u>Função:</u> <b>prev_prime</b><i> (<var>n</var>)</i>
<a name="IDX1070"></a>
</dt>
<dd><p>Retorna o maior primo menor que <var>n</var>.
</p>
<pre class="example">(%i1) prev_prime(27);
(%o1)                       23
</pre></dd></dl>

<dl>
<dt><u>Função:</u> <b>qunit</b><i> (<var>n</var>)</i>
<a name="IDX1071"></a>
</dt>
<dd><p>Retorna a principal unidade do campo dos números quadráticos reais
<code>sqrt (<var>n</var>)</code> onde <var>n</var> é um inteiro,
i.e., o elemento cuja norma é unidade.
Isso é importante para resolver a equação de Pell <code>a^2 - <var>n</var> b^2 = 1</code>.
</p>
<pre class="example">(%i1) qunit (17);
(%o1)                     sqrt(17) + 4
(%i2) expand (% * (sqrt(17) - 4));
(%o2)                           1
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>totient</b><i> (<var>n</var>)</i>
<a name="IDX1072"></a>
</dt>
<dd><p>Retorna o número de inteiros menores que ou iguais a <var>n</var> que
são relativamente primos com <var>n</var>.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>zerobern</b>
<a name="IDX1073"></a>
</dt>
<dd><p>Valor por omissão: <code>true</code>
</p>
<p>Quando <code>zerobern</code> for <code>false</code>,
<code>bern</code> exclui os números de Bernoulli que forem iguais a zero. 
Veja <code>bern</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>zeta</b><i> (<var>n</var>)</i>
<a name="IDX1074"></a>
</dt>
<dd><p>Retorna a função zeta de Riemann se <var>x</var> for um inteiro negativo, 0, 1,
ou número par positivo,
e retorna uma forma substantiva <code>zeta (<var>n</var>)</code> para todos os outros argumentos,
incluindo não inteiros racionais, ponto flutuante, e argumentos complexos.
</p>
<p>Veja também <code>bfzeta</code> e <code>zeta%pi</code>.
</p>
<pre class="example">(%i1) map (zeta, [-4, -3, -2, -1, 0, 1, 2, 3, 4, 5]);
                                     2              4
           1        1     1       %pi            %pi
(%o1) [0, ---, 0, - --, - -, inf, ----, zeta(3), ----, zeta(5)]
          120       12    2        6              90
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>zeta%pi</b>
<a name="IDX1075"></a>
</dt>
<dd><p>Valor por omissão: <code>true</code>
</p>
<p>Quando <code>zeta%pi</code> for <code>true</code>, <code>zeta</code> retorna uma expressão
proporcional a <code>%pi^n</code> para inteiro par <code>n</code>.
De outra forma, <code>zeta</code> retorna uma forma substantiva <code>zeta (n)</code>
para inteiro par <code>n</code>.
</p>
<pre class="example">(%i1) zeta%pi: true$
(%i2) zeta (4);
                                 4
                              %pi
(%o2)                         ----
                               90
(%i3) zeta%pi: false$
(%i4) zeta (4);
(%o4)                        zeta(4)
</pre>
</dd></dl>


<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC123" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_32.html#SEC125" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC271" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>Dezembro, 9 2014</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
